7767517
36 40
Input                    in0                      0 1 in0
ConvolutionDepthWise     convdw_28                1 1 in0 1 0=3 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27 7=3
Convolution              convrelu_0               1 1 1 2 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192 9=1
Split                    splitncnn_0              1 2 2 3 4
Pooling                  maxpool2d_15             1 1 4 5 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_29                1 1 5 6 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              convrelu_1               1 1 6 7 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_1              1 2 7 8 9
Pooling                  maxpool2d_16             1 1 9 10 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_30                1 1 10 11 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_2               1 1 11 12 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_2              1 2 12 13 14
Pooling                  maxpool2d_17             1 1 14 15 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_31                1 1 15 16 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_3               1 1 16 17 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Split                    splitncnn_3              1 2 17 18 19
Pooling                  maxpool2d_18             1 1 19 20 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_32                1 1 20 21 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Convolution              convrelu_4               1 1 21 22 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Deconvolution            deconv_11                1 1 22 23 0=512 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=2097152
Concat                   cat_0                    2 1 23 18 24 0=0
ConvolutionDepthWise     convdw_33                1 1 24 25 0=1024 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=1024
Convolution              convrelu_5               1 1 25 26 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Deconvolution            deconv_12                1 1 26 27 0=256 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=524288
Concat                   cat_1                    2 1 27 13 28 0=0
ConvolutionDepthWise     convdw_34                1 1 28 29 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Convolution              convrelu_6               1 1 29 30 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Deconvolution            deconv_13                1 1 30 31 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=131072
Concat                   cat_2                    2 1 31 8 32 0=0
ConvolutionDepthWise     convdw_35                1 1 32 33 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_7               1 1 33 34 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Deconvolution            deconv_14                1 1 34 35 0=64 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=32768
Concat                   cat_3                    2 1 35 3 36 0=0
ConvolutionDepthWise     convdw_36                1 1 36 37 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_8               1 1 37 38 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convsigmoid_9            1 1 38 out0 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
