7767517
20 22
Input                    in0                      0 1 in0
ConvolutionDepthWise     convdw_16                1 1 in0 1 0=3 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27 7=3
Convolution              convrelu_0               1 1 1 2 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192 9=1
Split                    splitncnn_0              1 2 2 3 4
Pooling                  maxpool2d_9              1 1 4 5 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_17                1 1 5 6 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              convrelu_1               1 1 6 7 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_1              1 2 7 8 9
Pooling                  maxpool2d_10             1 1 9 10 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
ConvolutionDepthWise     convdw_18                1 1 10 11 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_2               1 1 11 12 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Deconvolution            deconv_7                 1 1 12 13 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=131072
Concat                   cat_0                    2 1 13 8 14 0=0
ConvolutionDepthWise     convdw_19                1 1 14 15 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              convrelu_3               1 1 15 16 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Deconvolution            deconv_8                 1 1 16 17 0=64 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=32768
Concat                   cat_1                    2 1 17 3 18 0=0
ConvolutionDepthWise     convdw_20                1 1 18 19 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              convrelu_4               1 1 19 20 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convsigmoid_5            1 1 20 out0 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=4
